# This Tutorial About the Dataframe by the Dist

In [55]:
people = {
    "Name" : ["Jafar","Rolex","Vikram"],
    "No"   : [10,20,30],
    "Email": ["shaikmohammadhussain999@gmail.com","Rolex@gmail.com","Vikram@gmail.com"]
}

In [56]:
people['Name'][0]

'Jafar'

In [57]:
import pandas as pd

In [58]:
df = pd.DataFrame(people)

In [59]:
df

     Name  No                              Email
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Rolex  20                    Rolex@gmail.com
2  Vikram  30                   Vikram@gmail.com

# Data Frame is simple convert data into tabular form

In [60]:
df['Name']

0     Jafar
1     Rolex
2    Vikram
Name: Name, dtype: object

In [61]:
df.Name

0     Jafar
1     Rolex
2    Vikram
Name: Name, dtype: object

In [62]:
#Both are the same we access in the both way Most of the time access in the barcket

In [63]:
#To acces the multi columns
df[['Name','No']]

     Name  No
0   Jafar  10
1   Rolex  20
2  Vikram  30

# columns : attributes is print the all columns name

In [64]:
df.columns

Index(['Name', 'No', 'Email'], dtype='object')


# iloc : function is return the paticular index row

In [65]:
df.iloc[0] #Take the index value want to print

Name                                 Jafar
No                                      10
Email    shaikmohammadhussain999@gmail.com
Name: 0, dtype: object

In [66]:
df.iloc[[0,1]]

    Name  No                              Email
0  Jafar  10  shaikmohammadhussain999@gmail.com
1  Rolex  20                    Rolex@gmail.com

In [67]:
df.iloc[[0,1],[0,1]]

    Name  No
0  Jafar  10
1  Rolex  20

In [68]:
df

     Name  No                              Email
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Rolex  20                    Rolex@gmail.com
2  Vikram  30                   Vikram@gmail.com

# loc : function is return the paticular index row and but Columns as string

In [69]:
df.loc[0] #similat to iloc

Name                                 Jafar
No                                      10
Email    shaikmohammadhussain999@gmail.com
Name: 0, dtype: object

In [70]:
df.loc[[0,1]]

    Name  No                              Email
0  Jafar  10  shaikmohammadhussain999@gmail.com
1  Rolex  20                    Rolex@gmail.com

In [71]:
df.loc[[0,1],'Name']

0    Jafar
1    Rolex
Name: Name, dtype: object

In [73]:
df.loc[[0,1],['Name','Email']]

    Name                              Email
0  Jafar  shaikmohammadhussain999@gmail.com
1  Rolex                    Rolex@gmail.com

iloc is used to get the row and columns but to access we use the integer values abut in loc we use string like column name as the columns